; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p10---int100n150-m25---int100c150---s256---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level17 level17)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level17 level18)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level17 level19)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level17 level20)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level17 level21)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level17 level22)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level17 level23)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level17 level24)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level17 level25)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level17 level26)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level17 level27)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level17 level28)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level17 level29)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level17 level30)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level17 level31)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level17 level32)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level17 level33)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level17 level34)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level17 level35)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level17 level36)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level17 level37)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level17 level38)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level17 level39)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level17 level40)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level17 level41)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level17 level42)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level17 level43)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level17 level44)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level17 level45)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level17 level46)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level17 level47)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level17 level48)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level17 level49)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level17 level50)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level17 level51)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level17 level52)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level17 level53)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level17 level54)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level17 level55)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level17 level56)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level17 level57)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level17 level58)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level17 level59)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level17 level60)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level17 level61)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level17 level62)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level17 level63)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level17 level64)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level17 level65)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level17 level66)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level17 level67)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level17 level68)
(sum level51 level23 level74)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level17 level69)
(sum level52 level23 level75)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level17 level70)
(sum level53 level23 level76)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level17 level71)
(sum level54 level23 level77)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level17 level72)
(sum level55 level23 level78)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level17 level73)
(sum level56 level23 level79)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level17 level74)
(sum level57 level23 level80)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level6 level64)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level17 level75)
(sum level58 level23 level81)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level6 level65)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level17 level76)
(sum level59 level23 level82)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level6 level66)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level17 level77)
(sum level60 level23 level83)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level6 level67)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level17 level78)
(sum level61 level23 level84)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level6 level68)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level62 level17 level79)
(sum level62 level23 level85)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level6 level69)
(sum level63 level12 level75)
(sum level63 level13 level76)
(sum level63 level17 level80)
(sum level63 level23 level86)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level6 level70)
(sum level64 level12 level76)
(sum level64 level13 level77)
(sum level64 level17 level81)
(sum level64 level23 level87)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level6 level71)
(sum level65 level12 level77)
(sum level65 level13 level78)
(sum level65 level17 level82)
(sum level65 level23 level88)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level6 level72)
(sum level66 level12 level78)
(sum level66 level13 level79)
(sum level66 level17 level83)
(sum level66 level23 level89)
(sum level66 level25 level91)
(sum level67 level1 level68)
(sum level67 level6 level73)
(sum level67 level12 level79)
(sum level67 level13 level80)
(sum level67 level17 level84)
(sum level67 level23 level90)
(sum level67 level25 level92)
(sum level68 level1 level69)
(sum level68 level6 level74)
(sum level68 level12 level80)
(sum level68 level13 level81)
(sum level68 level17 level85)
(sum level68 level23 level91)
(sum level68 level25 level93)
(sum level69 level1 level70)
(sum level69 level6 level75)
(sum level69 level12 level81)
(sum level69 level13 level82)
(sum level69 level17 level86)
(sum level69 level23 level92)
(sum level69 level25 level94)
(sum level70 level1 level71)
(sum level70 level6 level76)
(sum level70 level12 level82)
(sum level70 level13 level83)
(sum level70 level17 level87)
(sum level70 level23 level93)
(sum level70 level25 level95)
(sum level71 level1 level72)
(sum level71 level6 level77)
(sum level71 level12 level83)
(sum level71 level13 level84)
(sum level71 level17 level88)
(sum level71 level23 level94)
(sum level71 level25 level96)
(sum level72 level1 level73)
(sum level72 level6 level78)
(sum level72 level12 level84)
(sum level72 level13 level85)
(sum level72 level17 level89)
(sum level72 level23 level95)
(sum level72 level25 level97)
(sum level73 level1 level74)
(sum level73 level6 level79)
(sum level73 level12 level85)
(sum level73 level13 level86)
(sum level73 level17 level90)
(sum level73 level23 level96)
(sum level73 level25 level98)
(sum level74 level1 level75)
(sum level74 level6 level80)
(sum level74 level12 level86)
(sum level74 level13 level87)
(sum level74 level17 level91)
(sum level74 level23 level97)
(sum level74 level25 level99)
(sum level75 level1 level76)
(sum level75 level6 level81)
(sum level75 level12 level87)
(sum level75 level13 level88)
(sum level75 level17 level92)
(sum level75 level23 level98)
(sum level75 level25 level100)
(sum level76 level1 level77)
(sum level76 level6 level82)
(sum level76 level12 level88)
(sum level76 level13 level89)
(sum level76 level17 level93)
(sum level76 level23 level99)
(sum level76 level25 level101)
(sum level77 level1 level78)
(sum level77 level6 level83)
(sum level77 level12 level89)
(sum level77 level13 level90)
(sum level77 level17 level94)
(sum level77 level23 level100)
(sum level77 level25 level102)
(sum level78 level1 level79)
(sum level78 level6 level84)
(sum level78 level12 level90)
(sum level78 level13 level91)
(sum level78 level17 level95)
(sum level78 level23 level101)
(sum level78 level25 level103)
(sum level79 level1 level80)
(sum level79 level6 level85)
(sum level79 level12 level91)
(sum level79 level13 level92)
(sum level79 level17 level96)
(sum level79 level23 level102)
(sum level79 level25 level104)
(sum level80 level1 level81)
(sum level80 level6 level86)
(sum level80 level12 level92)
(sum level80 level13 level93)
(sum level80 level17 level97)
(sum level80 level23 level103)
(sum level80 level25 level105)
(sum level81 level1 level82)
(sum level81 level6 level87)
(sum level81 level12 level93)
(sum level81 level13 level94)
(sum level81 level17 level98)
(sum level81 level23 level104)
(sum level81 level25 level106)
(sum level82 level1 level83)
(sum level82 level6 level88)
(sum level82 level12 level94)
(sum level82 level13 level95)
(sum level82 level17 level99)
(sum level82 level23 level105)
(sum level82 level25 level107)
(sum level83 level1 level84)
(sum level83 level6 level89)
(sum level83 level12 level95)
(sum level83 level13 level96)
(sum level83 level17 level100)
(sum level83 level23 level106)
(sum level83 level25 level108)
(sum level84 level1 level85)
(sum level84 level6 level90)
(sum level84 level12 level96)
(sum level84 level13 level97)
(sum level84 level17 level101)
(sum level84 level23 level107)
(sum level84 level25 level109)
(sum level85 level1 level86)
(sum level85 level6 level91)
(sum level85 level12 level97)
(sum level85 level13 level98)
(sum level85 level17 level102)
(sum level85 level23 level108)
(sum level85 level25 level110)
(sum level86 level1 level87)
(sum level86 level6 level92)
(sum level86 level12 level98)
(sum level86 level13 level99)
(sum level86 level17 level103)
(sum level86 level23 level109)
(sum level86 level25 level111)
(sum level87 level1 level88)
(sum level87 level6 level93)
(sum level87 level12 level99)
(sum level87 level13 level100)
(sum level87 level17 level104)
(sum level87 level23 level110)
(sum level87 level25 level112)
(sum level88 level1 level89)
(sum level88 level6 level94)
(sum level88 level12 level100)
(sum level88 level13 level101)
(sum level88 level17 level105)
(sum level88 level23 level111)
(sum level88 level25 level113)
(sum level89 level1 level90)
(sum level89 level6 level95)
(sum level89 level12 level101)
(sum level89 level13 level102)
(sum level89 level17 level106)
(sum level89 level23 level112)
(sum level89 level25 level114)
(sum level90 level1 level91)
(sum level90 level6 level96)
(sum level90 level12 level102)
(sum level90 level13 level103)
(sum level90 level17 level107)
(sum level90 level23 level113)
(sum level90 level25 level115)
(sum level91 level1 level92)
(sum level91 level6 level97)
(sum level91 level12 level103)
(sum level91 level13 level104)
(sum level91 level17 level108)
(sum level91 level23 level114)
(sum level91 level25 level116)
(sum level92 level1 level93)
(sum level92 level6 level98)
(sum level92 level12 level104)
(sum level92 level13 level105)
(sum level92 level17 level109)
(sum level92 level23 level115)
(sum level92 level25 level117)
(sum level93 level1 level94)
(sum level93 level6 level99)
(sum level93 level12 level105)
(sum level93 level13 level106)
(sum level93 level17 level110)
(sum level93 level23 level116)
(sum level93 level25 level118)
(sum level94 level1 level95)
(sum level94 level6 level100)
(sum level94 level12 level106)
(sum level94 level13 level107)
(sum level94 level17 level111)
(sum level94 level23 level117)
(sum level94 level25 level119)
(sum level95 level1 level96)
(sum level95 level6 level101)
(sum level95 level12 level107)
(sum level95 level13 level108)
(sum level95 level17 level112)
(sum level95 level23 level118)
(sum level95 level25 level120)
(sum level96 level1 level97)
(sum level96 level6 level102)
(sum level96 level12 level108)
(sum level96 level13 level109)
(sum level96 level17 level113)
(sum level96 level23 level119)
(sum level97 level1 level98)
(sum level97 level6 level103)
(sum level97 level12 level109)
(sum level97 level13 level110)
(sum level97 level17 level114)
(sum level97 level23 level120)
(sum level98 level1 level99)
(sum level98 level6 level104)
(sum level98 level12 level110)
(sum level98 level13 level111)
(sum level98 level17 level115)
(sum level99 level1 level100)
(sum level99 level6 level105)
(sum level99 level12 level111)
(sum level99 level13 level112)
(sum level99 level17 level116)
(sum level100 level1 level101)
(sum level100 level6 level106)
(sum level100 level12 level112)
(sum level100 level13 level113)
(sum level100 level17 level117)
(sum level101 level1 level102)
(sum level101 level6 level107)
(sum level101 level12 level113)
(sum level101 level13 level114)
(sum level101 level17 level118)
(sum level102 level1 level103)
(sum level102 level6 level108)
(sum level102 level12 level114)
(sum level102 level13 level115)
(sum level102 level17 level119)
(sum level103 level1 level104)
(sum level103 level6 level109)
(sum level103 level12 level115)
(sum level103 level13 level116)
(sum level103 level17 level120)
(sum level104 level1 level105)
(sum level104 level6 level110)
(sum level104 level12 level116)
(sum level104 level13 level117)
(sum level105 level1 level106)
(sum level105 level6 level111)
(sum level105 level12 level117)
(sum level105 level13 level118)
(sum level106 level1 level107)
(sum level106 level6 level112)
(sum level106 level12 level118)
(sum level106 level13 level119)
(sum level107 level1 level108)
(sum level107 level6 level113)
(sum level107 level12 level119)
(sum level107 level13 level120)
(sum level108 level1 level109)
(sum level108 level6 level114)
(sum level108 level12 level120)
(sum level109 level1 level110)
(sum level109 level6 level115)
(sum level110 level1 level111)
(sum level110 level6 level116)
(sum level111 level1 level112)
(sum level111 level6 level117)
(sum level112 level1 level113)
(sum level112 level6 level118)
(sum level113 level1 level114)
(sum level113 level6 level119)
(sum level114 level1 level115)
(sum level114 level6 level120)
(sum level115 level1 level116)
(sum level116 level1 level117)
(sum level117 level1 level118)
(sum level118 level1 level119)
(sum level119 level1 level120)

(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level17 l0 l4)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l3)
(fuelcost level1 l2 l3)
(connected l2 l4)
(fuelcost level12 l2 l4)
(connected l2 l6)
(fuelcost level13 l2 l6)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l3 l2)
(fuelcost level1 l3 l2)
(connected l3 l5)
(fuelcost level23 l3 l5)
(connected l4 l0)
(fuelcost level17 l4 l0)
(connected l4 l2)
(fuelcost level12 l4 l2)
(connected l4 l5)
(fuelcost level13 l4 l5)
(connected l5 l3)
(fuelcost level23 l5 l3)
(connected l5 l4)
(fuelcost level13 l5 l4)
(connected l6 l2)
(fuelcost level13 l6 l2)

(at t0 l5)
(fuel t0 level120)
(= (total-cost) 0)

(at p0 l2)
(at p1 l4)
(at p2 l6)
(at p3 l5)
(at p4 l6)
(at p5 l3)
(at p6 l3)
(at p7 l4)
(at p8 l4)
(at p9 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l6)
(at p2 l4)
(at p3 l4)
(at p4 l3)
(at p5 l1)
(at p6 l6)
(at p7 l6)
(at p8 l2)
(at p9 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 10
2. (drive t0 l5 l4 level107 level13 level120)
   deleted: (at t0 l5) (fuel t0 level120)
   added: (at t0 l4) (fuel t0 level107)
   goals met: 0 of 10
3. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 1 of 10
4. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 1 of 10
5. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 1 of 10
6. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 1 of 10
7. (drive t0 l4 l2 level95 level12 level107)
   deleted: (at t0 l4) (fuel t0 level107)
   added: (at t0 l2) (fuel t0 level95)
   goals met: 1 of 10
8. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 2 of 10
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 10
10. (drive t0 l2 l3 level94 level1 level95)
   deleted: (at t0 l2) (fuel t0 level95)
   added: (at t0 l3) (fuel t0 level94)
   goals met: 2 of 10
11. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 2 of 10
12. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 2 of 10
13. (drive t0 l3 l1 level93 level1 level94)
   deleted: (at t0 l3) (fuel t0 level94)
   added: (at t0 l1) (fuel t0 level93)
   goals met: 2 of 10
14. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 3 of 10
15. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 4 of 10
16. (drive t0 l1 l2 level80 level13 level93)
   deleted: (at t0 l1) (fuel t0 level93)
   added: (at t0 l2) (fuel t0 level80)
   goals met: 4 of 10
17. (drive t0 l2 l6 level67 level13 level80)
   deleted: (at t0 l2) (fuel t0 level80)
   added: (at t0 l6) (fuel t0 level67)
   goals met: 4 of 10
18. (load p2 t0 l6)
   deleted: (at p2 l6)
   added: (in p2 t0)
   goals met: 4 of 10
19. (load p4 t0 l6)
   deleted: (at p4 l6)
   added: (in p4 t0)
   goals met: 4 of 10
20. (unload p1 t0 l6)
   deleted: (in p1 t0)
   added: (at p1 l6)
   goals met: 5 of 10
21. (unload p6 t0 l6)
   deleted: (in p6 t0)
   added: (at p6 l6)
   goals met: 6 of 10
22. (unload p7 t0 l6)
   deleted: (in p7 t0)
   added: (at p7 l6)
   goals met: 7 of 10
23. (drive t0 l6 l2 level54 level13 level67)
   deleted: (at t0 l6) (fuel t0 level67)
   added: (at t0 l2) (fuel t0 level54)
   goals met: 7 of 10
24. (drive t0 l2 l3 level53 level1 level54)
   deleted: (at t0 l2) (fuel t0 level54)
   added: (at t0 l3) (fuel t0 level53)
   goals met: 7 of 10
25. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 7 of 10
26. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 8 of 10
27. (drive t0 l3 l0 level28 level25 level53)
   deleted: (at t0 l3) (fuel t0 level53)
   added: (at t0 l0) (fuel t0 level28)
   goals met: 8 of 10
28. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 9 of 10
29. (drive t0 l0 l4 level11 level17 level28)
   deleted: (at t0 l0) (fuel t0 level28)
   added: (at t0 l4) (fuel t0 level11)
   goals met: 9 of 10
30. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 10 of 10
